КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_Аутентификация/КонтурЛогистика_Аутентификация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_Аутентификация</name>
  <resources>
    <name>ДатаОкончания</name>
    <comment>Местное время</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ВремяЖизни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УниверсальнаяДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УниверсальнаяДатаОкончанияМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортальныйИд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ПроизвольныеДанные/КонтурЛогистика_ПроизвольныеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_ПроизвольныеДанные</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ГорючеСмазочныеМатериалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Из какого объекта произошла конвертация</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаКонвертацииРС</name>
    <comment>Какая НКРС использовалась при синх. в 1С</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_НастройкиКонвертацииРегистровСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизацияССервисом</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыСинхронизации</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизацияСОбъектом1С</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыСинхронизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОрганизацияДиадок</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез1</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез2</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез2</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПоказанийТоплива</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез3</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез3</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтатусыСинхронизации/КонтурЛогистика_СтатусыСинхронизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыСинхронизации</name>
  <enumValues>
    <name>НеНачата</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Пропустить</name>
  </enumValues>
  <enumValues>
    <name>УспешноЗавершена</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Партнеры/КонтурЛогистика_Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_Партнеры</name>
  <attributes>
    <name>КодПартнераКонтур</name>
    <comment>Идентификатор партнера в сервисах ЭДО Контура</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭПДФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭПДТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭПДЭлПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Медик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОрганизацииДиадок</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
    <attributes>
      <name>ГО</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПВ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГП</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Диспетчер</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Медик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Техник</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>boxId</name>
      <comment>ящик диадок (на случай если роуминг или несколько провайдеров)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Настройки</name>
    <attributes>
      <name>Настройка</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_Настройки</types>
        <types>CatalogRef.КонтурЛогистика_НастройкиПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Обработчики</name>
    <attributes>
      <name>Событие</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СобытияОбработчиковПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстОбработкиПослеЗаполнения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПунктыМаршрута</name>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GLN</name>
      <comment>необязательно, (Global Location Number) — глобальный идентификационный номер. Он применяется для распознавания организаций, их частей и объектов: складов, магазинов, производств, автомобилей. GLN — международный код</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресИндекс</name>
      <comment>(варинат 2) Индекс - обязателен при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресКодРегион</name>
      <comment>(вариант 2) Код региона - обязателен при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресИнфКодСтраны</name>
      <comment>(вариант 1) Страна - обязательна при указании адреса простым текстом</comment>
      <type>
        <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресГород</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресНаселПункт</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресУлица</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресРайон</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресДом</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресКорпус</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресКварт</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отправление</name>
      <comment>Признак, что Может выступать в этой базе данных в качестве точки:отправления</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Прибытие</name>
      <comment>Признак, что Может выступать в этой базе данных в качестве точки:прибытия</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/CommonModules/КонтурЛогистика_ИнтеграцияEDI_Сервер/Module.bsl
// идет на сервер, качает оттуда XML с PARTIN, парсит, возвращает.
Функция ПолучитьСтруктуруДанныхТорговойСети(КодСети) Экспорт
	
	Результат = ПолучитьФайл_EDI("/1c/nets/V2/" + КодСети + ".zip");
	
	Если Результат = Неопределено Тогда 
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения("Не удалось загрузить описание " + ?(КодСети = "list", "списка сетей", "сети """ + КодСети + """") + " с сервера. 
		|Возможные проблемы: отсутствует соединение с сервером или файл на сервере.");
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(ОписаниеОшибки());
		
		Возврат Неопределено;
	КонецЕсли;
	
	ВременныйКаталог = ПолучитьИмяВременногоФайла() + ПолучитьРазделительПути();
	СоздатьКаталог(ВременныйКаталог);
	
	Попытка
		ЧтениеZipФайла = Новый ЧтениеZipФайла(Результат.ОткрытьПотокДляЧтения());
		ЧтениеZipФайла.ИзвлечьВсе(ВременныйКаталог);
		ЧтениеZipФайла.Закрыть();
	Исключение
		Ошибка			= ИнформацияОбОшибке();
		ПодробнаяОшибка	= ПодробноеПредставлениеОшибки(Ошибка);
		Сообщить(ПодробнаяОшибка);
	КонецПопытки;
	
	ДанныеПоТС = ПрочитатьДанныеПоТорговойСети(ВременныйКаталог + КодСети + ".xml");
	
	УдалитьВременныйКаталог(ВременныйКаталог);
	
	Возврат ДанныеПоТС;
	
КонецФункции

Процедура УдалитьВременныйКаталог(ВременныйКаталог) 
	
	Попытка	
		
		Файлы = НайтиФайлы(ВременныйКаталог, "*", Истина);
		Для каждого ВыбФайл Из Файлы Цикл 
			Если ВыбФайл.ПолучитьТолькоЧтение() Тогда
				ВыбФайл.УстановитьТолькоЧтение(Ложь);
			КонецЕсли;	                           
		КонецЦикла;
		УдалитьФайлы(ВременныйКаталог);
		
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьФайл_EDI(ИмяФайла) 
	
	Перем Сервер;
	
	Сервер = "edi.kontur.ru";
	
	Попытка 
		Возврат HTTP_GetFile(Сервер, ИмяФайла);
	Исключение
		
	КонецПопытки;
	
КонецФункции

Функция HTTP_GetFile(СерверХост, ПутьКФайлуНаСервере)
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	ПараметрыЗапроса.Вставить("ТелоОтвета" , Новый Структура("ДвоичныеДанные"));
	ПараметрыЗапроса.Вставить("Таймаут"    , 0);
	ПараметрыЗапроса.Вставить("АдресМетода", ПреобразоватьКURL_КонтурEDI(ПутьКФайлуНаСервере));
	ПараметрыЗапроса.Вставить("ТелоОтветаКакДвоичныеДанные", Истина);
	ПараметрыЗапроса.Вставить("Заголовки", Новый Соответствие);
	
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика();
	ПараметрыСервиса.Вставить("АдресВебСервиса", СерверХост);
	
	НастройкиПрокси = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.НастройкиПрокси();
	
	Если НастройкиПрокси.ПроксиИспользовать Тогда
		
		Прокси = Новый Структура;
		Прокси.Вставить("host"		, НастройкиПрокси.АдресПроксиСервера + ":" + Формат(НастройкиПрокси.ПортПроксиСервера,"ЧГ=0"));
		Прокси.Вставить("username"  , НастройкиПрокси.ЛогинПроксиСервера);
		Прокси.Вставить("password"  , НастройкиПрокси.ПарольПроксиСервера);
		
		ПараметрыЗапроса.Вставить("Прокси", Прокси);
		
	КонецЕсли;
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если ТипЗнч(Ответ.ТелоОтвета) = Тип("Структура") 
		Или Ответ.ТелоОтвета = Неопределено 
		Или Ответ.КодОтвета <> 200 Тогда
		
		Ответ.ТелоОтвета = Неопределено;
		
	КонецЕсли;
	
	Возврат Ответ.ТелоОтвета;
	
КонецФункции

Функция ПреобразоватьКURL_КонтурEDI(Стр)
	
	Длина = СтрДлина(Стр);
	Итог = "";
	
	Для Н = 1 По Длина Цикл
		
		Знак = Сред(Стр, Н, 1);
		Код  = КодСимвола(Знак);
		
		Если Знак = " " Тогда
			Итог = Итог + "%20";
		//ИначеЕсли Знак = "/" Тогда
		//	Итог = Итог + "%2F";
		ИначеЕсли Знак = "\" Тогда
			Итог = Итог + "%5C";
		ИначеЕсли ((Знак >= "a") И (Знак <= "z")) 
			ИЛИ	((Знак >= "A" ) И (Знак <= "Z")) 
			ИЛИ	((Знак >= "0" ) И (Знак <= "9")) Тогда
			
			Итог = Итог + Знак;
			
		Иначе
			
			Если (Код >= КодСимвола("А")) И (Код <= КодСимвола("п")) Тогда
				
				Итог = Итог + "%" + ПреобразоватьвСистему(208, 16) + "%" + ПреобразоватьвСистему(144 + Код - КодСимвола("А"), 16);
				
			ИначеЕсли (Код >= КодСимвола("р")) И (Код <= КодСимвола("я")) Тогда
				
				Итог = Итог + "%" + ПреобразоватьвСистему(209, 16) + "%" + ПреобразоватьвСистему(128 + Код - КодСимвола("р"), 16);
				
			ИначеЕсли (Знак = "ё") Тогда
				
				Итог = Итог + "%" + ПреобразоватьвСистему(209, 16) + "%" + ПреобразоватьвСистему(145, 16);
				
			ИначеЕсли (Знак = "Ё") Тогда
				
				Итог = Итог + "%" + ПреобразоватьвСистему(208, 16) + "%" + ПреобразоватьвСистему(129, 16);
				
			Иначе
				Итог = Итог + Знак;
			КонецЕсли;
		
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Итог;
	
КонецФункции

Функция ПреобразоватьвСистему(Число10, Система)
	
	Если Система > 36 ИЛИ Система < 2 Тогда
		Сообщить("Выбранная система исчисления не поддерживается");
		Возврат -1;
	КонецЕсли;
	
	СтрокаЗначений = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	СтрокаСистема = "";
	Пока Число10 > 0 Цикл
		РезДеления 			= Число10 / Система;
		ЧислоСистема 		= Цел(РезДеления);
		ОстатокОтДеления 	= Число10 - Система * (ЧислоСистема);
		СтрокаСистема 		= Сред(СтрокаЗначений, ОстатокОтДеления + 1, 1) + СтрокаСистема;
		Число10 			= ?(ЧислоСистема = 0, 0, РезДеления); 
	КонецЦикла;
	
	Нечётное = СтрДлина(СтрокаСистема) - Цел(СтрДлина(СтрокаСистема) / 2) * 2;
	Если Нечётное Тогда
		СтрокаСистема = "0" + СтрокаСистема;
	КонецЕсли;
	
	Возврат СтрокаСистема;
	
КонецФункции

Функция ПрочитатьДанныеПоТорговойСети(ПутьКФайлу)
	
	ЗагружаетсяСписокСетей = Ложь;
	Если Прав(ПутьКФайлу, 8) = "list.xml" Тогда 
		ЗагружаетсяСписокСетей = Истина;
	КонецЕсли;
	
	Если ЗагружаетсяСписокСетей Тогда
		
		СтруктураТС = Новый Структура("Сети");

		ТаблицаСетей = Новый ТаблицаЗначений;
		ДобавитьКолонкиВТаблицуЗначений(ТаблицаСетей, "Код,Наименование,GLN,Подключена,ДатаОбновления,НастройкиПоУмолчанию");//,ТребуемыеВерсии - пока не трогаем

	Иначе
		
		СтруктураТС = Новый Структура("GLN,Подразделения,ЮрФизЛица,ТочкиДоставки,НастройкиПоУмолчанию");
	
		ТаблицаПодразделений = Новый ТаблицаЗначений;
		ДобавитьКолонкиВТаблицуЗначений(ТаблицаПодразделений, "id,GLN,Наименование");
		
		ТаблицаЮрФизЛиц = Новый ТаблицаЗначений;
		ДобавитьКолонкиВТаблицуЗначений(ТаблицаЮрФизЛиц, "id,GLN,Наименование,ИНН,КПП,id_Подразделения");
		
		ТаблицаТочекДоставки = Новый ТаблицаЗначений;
		
		КС = Новый КвалификаторыСтроки(1000);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Строка"));
		ОписаниеТиповСтрока = Новый ОписаниеТипов(Массив, , КС);

		ДобавитьКолонкиВТаблицуЗначений(ТаблицаТочекДоставки, "id,GLN,КодРегиона,Наименование,КПП,Адрес,id_ЮрФизЛица,id_Подразделения,Индекс,ТипЛокализации,ПолныйАдрес", ОписаниеТиповСтрока);
		
		ТаблицаНастроекПоУмолчанию = Новый ТаблицаЗначений;
		ДобавитьКолонкиВТаблицуЗначений(ТаблицаНастроекПоУмолчанию, "ИмяНастройки,Значение");
		
	КонецЕсли;

	// получаем объект XDTO из XML
	
	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ПутьКФайлу);
	
	ФабрикаXDTO_PARTIN = ФабрикаXDTO_PARTIN();
	
	СтруктураТиповФабрики = ПолучитьСтруктуруТиповФабрики(ФабрикаXDTO_PARTIN);
	
	ТипДанных = ?(ЗагружаетсяСписокСетей, СтруктураТиповФабрики.organizationList, СтруктураТиповФабрики.company);
	Данные = ФабрикаXDTO_PARTIN.ПрочитатьXML(Чтение, ТипДанных);
	
	Чтение.Закрыть();
	
	Если ЗагружаетсяСписокСетей Тогда
		
		Для Каждого ОписаниеОрганизации Из Данные.org Цикл
			
			НоваяСтрока = ТаблицаСетей.Добавить();
			
			НоваяСтрока.GLN						= ОписаниеОрганизации.gln;
			НоваяСтрока.Код						= ОписаниеОрганизации.code;
			НоваяСтрока.Наименование			= ОписаниеОрганизации.name;
			НоваяСтрока.ДатаОбновления			= ОписаниеОрганизации.dateUpd;
			
		КонецЦикла;
		
		СтруктураТС.Сети			= ТаблицаСетей;

	Иначе //грузим отдельную сеть
		
		СтруктураТС.GLN				= Данные.gln;
		
		Для Каждого ОписаниеОрганизации Из Данные.org Цикл

			НоваяСтрока = ТаблицаЮрФизЛиц.Добавить();
			
			НоваяСтрока.GLN				= ОписаниеОрганизации.gln;
			НоваяСтрока.Наименование	= ОписаниеОрганизации.name;
			НоваяСтрока.ИНН				= ОписаниеОрганизации.inn;
			НоваяСтрока.КПП				= ОписаниеОрганизации.kpp;
			
		КонецЦикла;
		
		Для Каждого ОписаниеТочкиДоставки Из Данные.DP Цикл

			НоваяСтрока = ТаблицаТочекДоставки.Добавить();
			
			НоваяСтрока.GLN				= ОписаниеТочкиДоставки.gln;
			НоваяСтрока.Наименование	= ОписаниеТочкиДоставки.name;
			НоваяСтрока.КодРегиона		= ОписаниеТочкиДоставки.region;
			НоваяСтрока.КПП				= ОписаниеТочкиДоставки.kpp;
			НоваяСтрока.Адрес			= ОписаниеТочкиДоставки.address;
			НоваяСтрока.Индекс			= ОписаниеТочкиДоставки.index;
			НоваяСтрока.ТипЛокализации  = ОписаниеТочкиДоставки.localizationType;
			НоваяСтрока.ПолныйАдрес 	= ОписаниеТочкиДоставки.index + ", " + ОписаниеТочкиДоставки.address;
			
		КонецЦикла;

		СтруктураТС.Подразделения			= ТаблицаПодразделений;
		СтруктураТС.ЮрФизЛица				= ТаблицаЮрФизЛиц;
		СтруктураТС.ТочкиДоставки			= ТаблицаТочекДоставки;
		СтруктураТС.НастройкиПоУмолчанию	= ТаблицаНастроекПоУмолчанию;
		
	КонецЕсли;
	
	Возврат СтруктураТС;
	
КонецФункции

Функция ПолучитьСтруктуруТиповФабрики(ФабрикаXDTO_EdiXml)
	
	СтруктураТипов = Новый Структура;
	
	Для Каждого Пакет Из ФабрикаXDTO_EdiXml.Пакеты Цикл
		Если Найти(ВРЕГ(Пакет.URIПространстваИмен),".KONTUR.RU")>0 Тогда //берем только наши фабрики
			Для Сч=0 По Пакет.Количество()-1 Цикл
				Свойство = Пакет.Получить(Сч);
				СтруктураТипов.Вставить(Свойство.Имя,Свойство);
			КонецЦикла;	
			
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат СтруктураТипов;
	
КонецФункции	

Функция ФабрикаXDTO_PARTIN()
		
	ФайлСхемы = ПолучитьИмяВременногоФайла("xsd");
	ПолучитьОбщийМакет("КонтурЛогистика_ИнтеграцияEDI_СхемыPARTIN").Записать(ФайлСхемы);
	Результат = СоздатьФабрикуXDTO(ФайлСхемы);
	УдалитьФайлы(ФайлСхемы);
	
	Возврат Результат;
	
КонецФункции

//Добавляет Колонки в Таблица.
//В Колонки допускается массив, Строка с разделителями "," или Символы.ПС
Процедура ДобавитьКолонкиВТаблицуЗначений(Таблица,Колонки,ОписаниеТипов = Неопределено)
	
	Если ТипЗнч(Колонки) = Тип("Массив") Тогда
		МассивИменКолонок = Колонки;
	Иначе
		МассивИменКолонок = EDI_РазложитьСтрокуВМассивСлов(Колонки,",;");
	КонецЕсли;
	
	НеобходимоТипизировать = ТипЗнч(ОписаниеТипов) = Тип("ОписаниеТипов");
	МассивНеТипизированныхКолонок = Новый Массив;
	
	Для Каждого ИмяКолонки Из МассивИменКолонок Цикл
		
		Колонка = Таблица.Колонки.Найти(ИмяКолонки);
		
		Если Колонка = Неопределено Тогда
			Колонка = Таблица.Колонки.Добавить(ИмяКолонки,ОписаниеТипов);
		КонецЕсли;	
		
		Если НеобходимоТипизировать Тогда
			
			Если ОписаниеТипов.КвалификаторыСтроки.Длина <> 0
				И Колонка.ТипЗначения.КвалификаторыСтроки.Длина >= ОписаниеТипов.КвалификаторыСтроки.Длина Тогда
				
				МассивНеТипизированныхКолонок.Добавить(ИмяКолонки);
				
			Иначе
				
				Для Каждого ЭлементТип Из ОписаниеТипов.Типы() Цикл
					
					Если НЕ Колонка.ТипЗначения.СодержитТип(ЭлементТип) Тогда
						МассивНеТипизированныхКолонок.Добавить(ИмяКолонки);
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЦикла;
	
	Если НеобходимоТипизировать И МассивНеТипизированныхКолонок.Количество() > 0 Тогда
		
		Для Каждого НеТипизированнаяКолонка Из МассивНеТипизированныхКолонок Цикл
			
			ТипизироватьКолонкиВТаблицеЗначений(Таблица, НеТипизированнаяКолонка, ОписаниеТипов);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ТипизироватьКолонкиВТаблицеЗначений(ТаблицаЗначений, ИмяКолонокДляТипизации, ОписаниеТипов)
		
	ИмяКолонокДляТипизации =  СтрЗаменить(ИмяКолонокДляТипизации, ",", Символы.ПС);
	
	Для НомерСтроки = 1 По СтрЧислоСтрок(ИмяКолонокДляТипизации) Цикл
		
		ИмяКолонкиДляТипизации = СтрПолучитьСтроку(ИмяКолонокДляТипизации, НомерСтроки); 		
		ИмяКолонкиТипизированная = ИмяКолонкиДляТипизации + "_Типизированная"; 
		
		Колонка = ТаблицаЗначений.Колонки.Найти(ИмяКолонкиДляТипизации);
		
		Если Колонка = Неопределено Тогда
			
			Колонка = ТаблицаЗначений.Колонки.Добавить(ИмяКолонкиДляТипизации,ОписаниеТипов);
						
		Иначе
			
			Колонка = ТаблицаЗначений.Колонки.Добавить(ИмяКолонкиТипизированная,ОписаниеТипов);
									
			ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку(ИмяКолонкиДляТипизации), ИмяКолонкиТипизированная);
			
			ТаблицаЗначений.Колонки.Удалить(ИмяКолонкиДляТипизации);
			
			ТаблицаЗначений.Колонки.Найти(ИмяКолонкиТипизированная).Имя = ИмяКолонкиДляТипизации; 
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Разбивает строку на несколько строк, используя заданный набор разделителей.
//
// Параметры:
//  Строка          - Строка - строка, которую необходимо разложить на слова.
//  РазделителиСлов - Строка - строка, содержащая символы-разделители.
//
//  Возвращаемое значение:
//      массив значений, элементы которого - отдельные слова
//
// Пример:
//  РазложитьСтрокуВМассивСлов("один-@#два2_!три", "-") возвратит массив значений: "один", "@#два2_!три";
//  РазложитьСтрокуВМассивСлов("один-@#два2_!три", "#@!_") возвратит массив значений: "один-", "два2", "три".
//
Функция EDI_РазложитьСтрокуВМассивСлов(Знач Строка, РазделителиСлов="", РазделительКакЕдиныйСимвол = Ложь)
	
	Слова = Новый Массив;
	
	ДлинаРазделителя = СтрДлина(РазделителиСлов);
	
	Если ДлинаРазделителя = 1 ИЛИ РазделительКакЕдиныйСимвол Тогда
		
		НайденныйСимвол = Найти(Строка,РазделителиСлов);
		Пока НайденныйСимвол>0 Цикл
			Слова.Добавить(СокрЛП(Лев(Строка,НайденныйСимвол + ДлинаРазделителя - 2)));
			Строка = Сред(Строка,НайденныйСимвол + ДлинаРазделителя);
			НайденныйСимвол = Найти(Строка,РазделителиСлов);
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(Строка) Тогда
			Слова.Добавить(СокрЛП(Строка));
		КонецЕсли;
		
	Иначе
		
		Для Сч = 1 По СтрДлина(РазделителиСлов) Цикл
			Строка = СтрЗаменить(Строка,Сред(РазделителиСлов,Сч,1),Символы.ПС);
		КонецЦикла;
		
		Для Сч=1 По СтрЧислоСтрок(Строка) Цикл
			ТекСлово = СокрЛП(СтрПолучитьСтроку(Строка,Сч));
			Если ТекСлово<>"" Тогда
				Слова.Добавить(СокрЛП(ТекСлово));
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;
	
	Возврат Слова;
	
КонецФункции

#Область ПрограммныйИнтерфейс

// Обновляет кэш троек КодПартнера+ИНН+КПП всех торговых сетей PARTIN EDI
// в регистре КонтурЛогистика_ПроизвольныеДанные (одна запись, ДанныеХранилище).
// Источник: единый архив /1c/nets/V2/full-list.zip (файл full-list.xml).
// Если архив получить или разобрать не удалось — регистр не перезаписывается.
//
// Параметры:
//  ТихийРежим - Булево - Истина, чтобы не выводить сообщения хода выполнения
//
// Возвращаемое значение:
//  Структура:
//   * Успешно - Булево - Истина, если полный список получен и запись сохранена
//   * Количество - Число - число уникальных троек КодПартнера+ИНН+КПП
//   * ТекстОшибки - Строка - ошибки получения или разбора
//
Функция ОбновитьВсеИННПартнеровEDI(ТихийРежим = Ложь) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("Количество", 0);
	Результат.Вставить("ТекстОшибки", "");
	
	СообщитьХодОбновленияКэшаИННПартнеровEDI(
		"Начало обновления кэша ИНН+КПП партнеров EDI (full-list).",
		ТихийРежим);
	
	ДвоичныеДанныеАрхива = ПолучитьФайл_EDI("/1c/nets/V2/full-list.zip");
	
	Если ДвоичныеДанныеАрхива = Неопределено Тогда
		
		Результат.ТекстОшибки =
			"Не удалось скачать full-list.zip с сервера EDI. Существующий кэш не изменен.";
		СообщитьХодОбновленияКэшаИННПартнеровEDI(Результат.ТекстОшибки, ТихийРежим);
		Возврат Результат;
		
	КонецЕсли;
	
	СообщитьХодОбновленияКэшаИННПартнеровEDI(
		"Архив full-list.zip получен. Разбор full-list.xml...",
		ТихийРежим);
	
	ВременныйКаталог = ПолучитьИмяВременногоФайла() + ПолучитьРазделительПути();
	СоздатьКаталог(ВременныйКаталог);
	
	Попытка
		
		ЧтениеZipФайла = Новый ЧтениеZipФайла(ДвоичныеДанныеАрхива.ОткрытьПотокДляЧтения());
		ЧтениеZipФайла.ИзвлечьВсе(ВременныйКаталог);
		ЧтениеZipФайла.Закрыть();
		
		ПутьКXML = НайтиФайлПолногоСпискаИННПартнеровEDI(ВременныйКаталог);
		
		Если Не ЗначениеЗаполнено(ПутьКXML) Тогда
			ВызватьИсключение "В архиве full-list.zip не найден файл full-list.xml.";
		КонецЕсли;
		
		ТаблицаИНН = ПрочитатьПолныйСписокИННПартнеровEDI(ПутьКXML);
		
	Исключение
		
		УдалитьВременныйКаталог(ВременныйКаталог);
		
		Результат.ТекстОшибки = "Ошибка разбора full-list: "
			+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
			+ ". Существующий кэш не изменен.";
		СообщитьХодОбновленияКэшаИННПартнеровEDI(Результат.ТекстОшибки, ТихийРежим);
		Возврат Результат;
		
	КонецПопытки;
	
	УдалитьВременныйКаталог(ВременныйКаталог);
	
	ТаблицаИНН.Свернуть("КодПартнера,ИНН,КПП");
	ТаблицаИНН.Индексы.Очистить();
	ТаблицаИНН.Индексы.Добавить("ИНН,КПП");
	
	ЗаписатьИННПартнеровEDIВРегистр(ТаблицаИНН, "", Истина);
	
	Результат.Успешно = Истина;
	Результат.Количество = ТаблицаИНН.Количество();
	
	СообщитьХодОбновленияКэшаИННПартнеровEDI(
		"Обновление кэша ИНН+КПП партнеров EDI завершено. Уникальных троек КодПартнера+ИНН+КПП: "
		+ Строка(Результат.Количество)
		+ ".",
		ТихийРежим);
	
	Возврат Результат;
	
КонецФункции

// Создает партнера Контур.Логистика по коду PARTIN с заполнением только юр. лиц
// (точки доставки не синхронизируются).
//
// Параметры:
//  КодПартнераКонтур - Строка - код торговой сети PARTIN
//  ОрганизацияДД - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок - организация ДД (Грузополучатель) для ручного добавления в список организаций партнера
//
// Возвращаемое значение:
//  СправочникСсылка.КонтурЛогистика_Партнеры - созданный партнер
//
Функция СоздатьПартнераПоКодуПартнераКонтурТолькоЮрЛица(КодПартнераКонтур, ОрганизацияДД) Экспорт
	
	Наименование = КодПартнераКонтур;
	ДатаОбновления = Дата(1, 1, 1);
	
	СписокСетей = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьСтруктуруДанныхТорговойСети("list");
	
	Если СписокСетей <> Неопределено
		И СписокСетей.Свойство("Сети")
		И СписокСетей.Сети <> Неопределено Тогда
		
		СтрокаСети = СписокСетей.Сети.Найти(КодПартнераКонтур, "Код");
		
		Если СтрокаСети <> Неопределено Тогда
			Наименование = СтрокаСети.Наименование;
			ДатаОбновления = СтрокаСети.ДатаОбновления;
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("КодПартнераКонтур", КодПартнераКонтур);
	ДанныеЗаполнения.Вставить("Наименование", Наименование);
	ДанныеЗаполнения.Вставить("ДатаОбновления", ДатаОбновления);
	ДанныеЗаполнения.Вставить("ЗаполнятьТочкиДоставки", Ложь);
	ДанныеЗаполнения.Вставить("ОрганизацияДД", ОрганизацияДД);
	
	ПартнерОбъект = Справочники.КонтурЛогистика_Партнеры.СоздатьЭлемент();
	ПартнерОбъект.Заполнить(ДанныеЗаполнения);
	ПартнерОбъект.Записать();
	
	Возврат ПартнерОбъект.Ссылка;
	
КонецФункции

// Признак необходимости обновления кэша ИНН+КПП партнеров PARTIN EDI:
// включен ТРН или ПЭ и есть авторизованный наш грузоотправитель.
//
// Возвращаемое значение:
//  Булево
//
Функция ТребуетсяАктуализацияКэшаПартнеровEDI() Экспорт
	
	ИспользуетсяТРН = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяТРН");
	ИспользуетсяПЭ = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(
		"ИспользуетсяПоручениеЭкспедитору");
	
	Если Не ИспользуетсяТРН И Не ИспользуетсяПЭ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ЕстьАвторизованныйНашГрузоотправитель();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьАвторизованныйНашГрузоотправитель()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_Аутентификация КАК КонтурЛогистика_Аутентификация
	|		ПО КонтурЛогистика_Аутентификация.Организация = КонтурЛогистика_ОрганизацииДиадок.Ссылка
	|ГДЕ
	|	НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
	|	И КонтурЛогистика_ОрганизацииДиадок.Наш
	|	И КонтурЛогистика_ОрганизацииДиадок.Грузоотправитель
	|	И КонтурЛогистика_Аутентификация.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура СообщитьХодОбновленияКэшаИННПартнеровEDI(Текст, ТихийРежим)
	
	Если ТихийРежим Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(Текст);
	
КонецПроцедуры

Функция НайтиФайлПолногоСпискаИННПартнеровEDI(ВременныйКаталог)
	
	Файлы = НайтиФайлы(ВременныйКаталог, "full-list.xml", Истина);
	
	Если Файлы.Количество() > 0 Тогда
		Возврат Файлы[0].ПолноеИмя;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Читает full-list.xml формата:
// <Nets><net code="..." inn="..." kpp="..." type="org|dp"/></Nets>
//
Функция ПрочитатьПолныйСписокИННПартнеровEDI(ПутьКФайлу)
	
	ТаблицаИНН = НоваяТаблицаИННПартнеровEDI();
	
	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ПутьКФайлу);
	
	Пока Чтение.Прочитать() Цикл
		
		Если Чтение.ТипУзла <> ТипУзлаXML.НачалоЭлемента
			Или ВРег(Чтение.Имя) <> "NET" Тогда
			Продолжить;
		КонецЕсли;
		
		КодПартнера = ЗначениеАтрибутаXML(Чтение, "code");
		ИНН = ЗначениеАтрибутаXML(Чтение, "inn");
		КПП = ЗначениеАтрибутаXML(Чтение, "kpp");
		
		Если Не ЗначениеЗаполнено(КодПартнера)
			Или Не ЗначениеЗаполнено(ИНН) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаИНН.Добавить();
		НоваяСтрока.КодПартнера = КодПартнера;
		НоваяСтрока.ИНН = ИНН;
		НоваяСтрока.КПП = КПП;
		
	КонецЦикла;
	
	Чтение.Закрыть();
	
	Возврат ТаблицаИНН;
	
КонецФункции

Функция ЗначениеАтрибутаXML(Чтение, ИмяАтрибута)
	
	ЗначениеАтрибута = Чтение.ЗначениеАтрибута(ИмяАтрибута);
	
	Если ЗначениеАтрибута = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат СокрЛП(ЗначениеАтрибута);
	
КонецФункции

Функция НоваяТаблицаИННПартнеровEDI()
	
	ТаблицаИНН = Новый ТаблицаЗначений;
	ТаблицаИНН.Колонки.Добавить("КодПартнера", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	ТаблицаИНН.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(12)));
	ТаблицаИНН.Колонки.Добавить("КПП", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(9)));
	ТаблицаИНН.Индексы.Добавить("ИНН,КПП");
	
	Возврат ТаблицаИНН;
	
КонецФункции

Процедура ЗаписатьИННПартнеровEDIВРегистр(ТаблицаИНН, ТекстОшибки, УспешноПолученСписок)
	
	ТипДанных = РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ТипыДанных().ИННПартнеровEDI;
	ПустаяОрганизация = Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка();
	ПустойРазрез2 = Перечисления.КонтурЛогистика_ТипыПоказанийТоплива.ПустаяСсылка();
	
	НаборЗаписей = РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОрганизацияДиадок.Установить(ПустаяОрганизация);
	НаборЗаписей.Отбор.ТипДанных.Установить(ТипДанных);
	НаборЗаписей.Отбор.Разрез1.Установить("");
	НаборЗаписей.Отбор.Разрез2.Установить(ПустойРазрез2);
	НаборЗаписей.Отбор.Разрез3.Установить("");
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ОрганизацияДиадок = ПустаяОрганизация;
	НоваяЗапись.ТипДанных = ТипДанных;
	НоваяЗапись.Разрез1 = "";
	НоваяЗапись.Разрез2 = ПустойРазрез2;
	НоваяЗапись.Разрез3 = "";
	НоваяЗапись.Дата = КонтурЛогистика_ОбщегоНазначенияСервер.ТекущийМоментВремениМСК();
	НоваяЗапись.Количество = ТаблицаИНН.Количество();
	НоваяЗапись.ТекстОшибки = ТекстОшибки;
	НоваяЗапись.ДанныеХранилище = Новый ХранилищеЗначения(ТаблицаИНН, Новый СжатиеДанных(6));
	
	Если УспешноПолученСписок Тогда
		НоваяЗапись.СинхронизацияССервисом = Перечисления.КонтурЛогистика_СтатусыСинхронизации.УспешноЗавершена;
	Иначе
		НоваяЗапись.СинхронизацияССервисом = Перечисления.КонтурЛогистика_СтатусыСинхронизации.Ошибка;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
